zxf1023818103/at-project/src/Bl602UartOutStreamBuf.cpp
#if defined BL602 || defined BL702

#include "Bl602UartOutStreamBuf.h"
extern "C" {
#include <bl_uart.h>
}

namespace at {

Bl602UartOutStreamBuf::Bl602UartOutStreamBuf(uint8_t uartId)
    : m_id(uartId), m_stream(xStreamBufferCreate(kStreamBufSize, 1)) {
    setp(m_putBuf, m_putBuf + kPutBufSize);
    bl_uart_int_tx_notify_register(m_id, txIsr, this);
    // bl_uart_init() 不安装 UART IRQ 向量；调用 bl_uart_int_enable() 注册
    // UARTx_IRQHandler 并使能中断分发，再关掉 RX/TX 掩码，由 xsputn 按需打开 TX。
    bl_uart_int_enable(m_id);
    bl_uart_int_tx_disable(m_id);
}

Bl602UartOutStreamBuf::~Bl602UartOutStreamBuf() {
    sync();
    bl_uart_int_tx_disable(m_id);
    bl_uart_int_tx_notify_unregister(m_id, txIsr, this);
    vStreamBufferDelete(m_stream);
}

// Called from TX interrupt: feeds exactly one byte to the UART per call,
// relying on the hardware to fire the next interrupt when the FIFO is ready.
// On empty, the disable+recheck pair closes the race with a producer that
// may have written and re-enabled the interrupt during the read.
void Bl602UartOutStreamBuf::txIsr(void *arg) {
    auto      *self  = static_cast<Bl602UartOutStreamBuf *>(arg);
    BaseType_t woken = pdFALSE;
    uint8_t    byte;
    if (xStreamBufferReceiveFromISR(self->m_stream, &byte, 1, &woken) == 1) {
        bl_uart_data_send(self->m_id, byte);
    } else {
        bl_uart_int_tx_disable(self->m_id);
        if (xStreamBufferIsEmpty(self->m_stream) == pdFALSE) {
            bl_uart_int_tx_enable(self->m_id);
        }
    }
    portYIELD_FROM_ISR(woken);
}

int Bl602UartOutStreamBuf::flushPutArea() {
    char  *base = pbase();
    size_t len  = static_cast<size_t>(pptr() - base);
    if (len == 0) return 0;
    size_t sent = xStreamBufferSend(m_stream, base, len, portMAX_DELAY);
    setp(base, epptr());
    bl_uart_int_tx_enable(m_id);
    return (sent == len) ? 0 : -1;
}

int Bl602UartOutStreamBuf::overflow(int c) {
    if (flushPutArea() != 0) return traits_type::eof();
    if (!traits_type::eq_int_type(c, traits_type::eof())) {
        *pptr() = traits_type::to_char_type(c);
        pbump(1);
    }
    return traits_type::not_eof(c);
}

int Bl602UartOutStreamBuf::sync() {
    return flushPutArea();
}

std::streamsize Bl602UartOutStreamBuf::xsputn(const char_type *s, std::streamsize n) {
    if (flushPutArea() != 0) return 0;
    size_t sent = xStreamBufferSend(m_stream, s, static_cast<size_t>(n), portMAX_DELAY);
    if (sent > 0) {
        bl_uart_int_tx_enable(m_id);
    }
    return static_cast<std::streamsize>(sent);
}

}  // namespace at

#endif // defined BL602 || defined BL702
